street_cafes/lib/tasks/load_csv.rake

INSERT INTO "restaurants" ("name", "address", "post_code", "number_of_chairs", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    task :from_csv => :environment do
      SeedStarter.destroy_models
      puts 'Cleared Existing Models'

      SeedStarter.create_restaurants